Measd/app/controllers/floorplans_controller.rb

SELECT  "floorplans".* FROM "floorplans" WHERE "floorplans"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @floorplan = Floorplan.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "floorplans" ("name", "svg_data", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create

    @user = User.find(params[:user_id])
    p params[:user_id]
    p @user
    @floorplan = @user.floorplans.new(name: params[:name],svgtext: params[:data])
    if @floorplan.save