Measd/app/views/users/show.html.erb

                        <ul class="floorplan-list">
                        <% if @user.floorplans.count > 0 %>
---
SELECT "floorplans".* FROM "floorplans" WHERE "floorplans"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "floorplans" WHERE "floorplans"."user_id" = $1  [["user_id", 1]]